In [35]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'k1':['X','X','Y','Y','Z'],
                'k2':['alpha','beta','alpha','beta','alpha'],
                'dataset1':np.random.randn(5),
                'dataset2':np.random.randn(5)})
df

   dataset1  dataset2 k1     k2
0  1.509672  0.980354  X  alpha
1  1.128737 -0.022344  X   beta
2 -0.624590  0.741771  Y  alpha
3  0.688026  0.902705  Y   beta
4 -0.180179  0.936602  Z  alpha

In [3]:
group1 = df['dataset1'].groupby(df['k1'])
group1

In [4]:
group1.mean()

k1
X    1.319205
Y    0.031718
Z   -0.180179
Name: dataset1, dtype: float64

In [5]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [6]:
df['dataset1'].groupby([cities, month]).mean()

LA  FEB    1.128737
    JAN   -0.624590
NY  FEB    0.688026
    JAN    0.664746
Name: dataset1, dtype: float64

In [7]:
df

   dataset1  dataset2 k1     k2
0  1.509672  0.980354  X  alpha
1  1.128737 -0.022344  X   beta
2 -0.624590  0.741771  Y  alpha
3  0.688026  0.902705  Y   beta
4 -0.180179  0.936602  Z  alpha

In [8]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
X   1.319205  0.479005
Y   0.031718  0.822238
Z  -0.180179  0.936602

In [9]:
df.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.509672  0.980354
   beta   1.128737 -0.022344
Y  alpha -0.624590  0.741771
   beta   0.688026  0.902705
Z  alpha -0.180179  0.936602

In [10]:
df.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [11]:
for name,group in df.groupby('k1'):
    print("This is the "+name+" group")
    print(group)
    print("\n")

This is the X group
   dataset1  dataset2 k1     k2
0  1.509672  0.980354  X  alpha
1  1.128737 -0.022344  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -0.624590  0.741771  Y  alpha
3  0.688026  0.902705  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.180179  0.936602  Z  alpha

In [14]:
#Iterating through multiple keys
for (k1,k2), group in df.groupby(['k1','k2']):
    print("Key1 = "+k1+" ; Key2 = "+k2)
    print(group)
    print("\n")

Key1 = X ; Key2 = alpha
   dataset1  dataset2 k1     k2
0  1.509672  0.980354  X  alpha


Key1 = X ; Key2 = beta
   dataset1  dataset2 k1    k2
1  1.128737 -0.022344  X  beta


Key1 = Y ; Key2 = alpha
   dataset1  dataset2 k1     k2
2  -0.62459  0.741771  Y  alpha


Key1 = Y ; Key2 = beta
   dataset1  dataset2 k1    k2
3  0.688026  0.902705  Y  beta


Key1 = Z ; Key2 = alpha
   dataset1  dataset2 k1     k2
4 -0.180179  0.936602  Z  alpha

In [16]:
group_dict = dict(list(df.groupby('k1')))
group_dict

{'X':    dataset1  dataset2 k1     k2
 0  1.509672  0.980354  X  alpha
 1  1.128737 -0.022344  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2 -0.624590  0.741771  Y  alpha
 3  0.688026  0.902705  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4 -0.180179  0.936602  Z  alpha}

In [17]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  1.509672  0.980354  X  alpha
1  1.128737 -0.022344  X   beta

In [18]:
#Creating a dictionary for dtypes of objects
group_dict_axis1 = dict(list(df.groupby(df.dtypes, axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.509672  0.980354
 1  1.128737 -0.022344
 2 -0.624590  0.741771
 3  0.688026  0.902705
 4 -0.180179  0.936602, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [19]:
#Using GroupBy with columns
dataset2_group = df.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.980354
   beta  -0.022344
Y  alpha  0.741771
   beta   0.902705
Z  alpha  0.936602

# GroupBy on dictionary and series

In [21]:
animals = DataFrame(np.arange(16).reshape(4,4),
                    columns=['W','X','Y','Z'],
                    index=['Dog','Cat','Bird','Mouse'])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [23]:
animals.loc[1:2, ['W','Y']] = np.nan
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [27]:
#Dictionary with behavior values in it
behavior_map = {'W':'good', 'X':'bad', 'Y':'good', 'Z':'bad'}
animal_col = animals.groupby(behavior_map, axis=1)
animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [28]:
behave_series = Series(behavior_map)
behave_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [29]:
animals.groupby(behave_series, axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [30]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [32]:
#GroupBy the length of animal names
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [33]:
keys =  ['A', 'B', 'A', 'B']
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [36]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],
                                     [1,2,3,1,2]], 
                                     names=['City', 'sub_value'])
hier_col

MultiIndex(levels=[['NY', 'SF'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1], [0, 1, 2, 0, 1]],
           names=['City', 'sub_value'])

In [37]:
df_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col)
df_hr = df_hr*100
df_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400